{"payload":{"allShortcutsEnabled":false,"fileTree":{"":{"items":[{"name":".github","path":".github","contentType":"directory"},{"name":"lua","path":"lua","contentType":"directory"},{"name":"nixos","path":"nixos","contentType":"directory"},{"name":"scripts","path":"scripts","contentType":"directory"},{"name":"snips","path":"snips","contentType":"directory"},{"name":"tutor","path":"tutor","contentType":"directory"},{"name":".gitignore","path":".gitignore","contentType":"file"},{"name":"LICENSE","path":"LICENSE","contentType":"file"},{"name":"README.md","path":"README.md","contentType":"file"},{"name":"flake.nix","path":"flake.nix","contentType":"file"},{"name":"init.lua","path":"init.lua","contentType":"file"},{"name":"lazy-lock.json","path":"lazy-lock.json","contentType":"file"},{"name":"stylua.toml","path":"stylua.toml","contentType":"file"}],"totalCount":13}},"fileTreeProcessingTime":3.029748,"foldersToFetch":[],"reducedMotionEnabled":null,"repo":{"id":378319207,"defaultBranch":"main","name":"nvimdots","ownerLogin":"ayamir","currentUserCanPush":false,"isFork":false,"isEmpty":false,"createdAt":"2021-06-19T04:03:23.000Z","ownerAvatar":"https://avatars.githubusercontent.com/u/61657399?v=4","public":true,"private":false,"isOrgOwned":false},"symbolsExpanded":false,"treeExpanded":true,"refInfo":{"name":"main","listCacheKey":"v0:1693898692.0","canEdit":false,"refType":"branch","currentOid":"230495af5a2a8d3278c9a61cd87322319ec9ef46"},"path":"lazy-lock.json","currentUser":null,"blob":{"rawLines":["{","  \"Comment.nvim\": { \"branch\": \"master\", \"commit\": \"0236521ea582747b58869cb72f70ccfa967d2e89\" },","  \"LuaSnip\": { \"branch\": \"master\", \"commit\": \"ea7d7ea510c641c4f15042becd27f35b3e5b3c2b\" },","  \"accelerated-jk.nvim\": { \"branch\": \"main\", \"commit\": \"8fb5dad4ccc1811766cebf16b544038aeeb7806f\" },","  \"alpha-nvim\": { \"branch\": \"main\", \"commit\": \"5f211a1597b06be24b1600d72a62b94cab1e2df9\" },","  \"autoclose.nvim\": { \"branch\": \"main\", \"commit\": \"d8bebaaf8c48bd0cd0645d20592548eab279fea3\" },","  \"better-escape.nvim\": { \"branch\": \"master\", \"commit\": \"7031dc734add47bb71c010e0551829fa5799375f\" },","  \"bigfile.nvim\": { \"branch\": \"main\", \"commit\": \"9616b73670ffeb92679677554ded88854ae42cf8\" },","  \"bufferline.nvim\": { \"branch\": \"main\", \"commit\": \"9961d87bb3ec008213c46ba14b3f384a5f520eb5\" },","  \"catppuccin\": { \"branch\": \"refactor/syntax-highlighting\", \"commit\": \"395d5415867f0c1d9da8ed5fff584993483ab26c\" },","  \"clever-f.vim\": { \"branch\": \"master\", \"commit\": \"6a3ac5e3688598af9411ab741737f98c47370c22\" },","  \"cmp-buffer\": { \"branch\": \"main\", \"commit\": \"3022dbc9166796b644a841a02de8dd1cc1d311fa\" },","  \"cmp-latex-symbols\": { \"branch\": \"main\", \"commit\": \"165fb66afdbd016eaa1570e41672c4c557b57124\" },","  \"cmp-nvim-lsp\": { \"branch\": \"main\", \"commit\": \"44b16d11215dce86f253ce0c30949813c0a90765\" },","  \"cmp-nvim-lua\": { \"branch\": \"main\", \"commit\": \"f12408bdb54c39c23e67cab726264c10db33ada8\" },","  \"cmp-path\": { \"branch\": \"main\", \"commit\": \"91ff86cd9c29299a64f968ebb45846c485725f23\" },","  \"cmp-spell\": { \"branch\": \"master\", \"commit\": \"60584cb75e5e8bba5a0c9e4c3ab0791e0698bffa\" },","  \"cmp-tmux\": { \"branch\": \"main\", \"commit\": \"97ec06b8030b8bf6d1fd83d49bdd16c98e04c845\" },","  \"cmp-treesitter\": { \"branch\": \"master\", \"commit\": \"c8e3a74b51597d69d240085a258636972ce98e15\" },","  \"cmp-under-comparator\": { \"branch\": \"master\", \"commit\": \"6857f10272c3cfe930cece2afa2406e1385bfef8\" },","  \"cmp_luasnip\": { \"branch\": \"master\", \"commit\": \"18095520391186d634a0045dacaa346291096566\" },","  \"copilot-cmp\": { \"branch\": \"master\", \"commit\": \"11eb015fbf9f07ad1c72dbdc9d830ebac610b5cd\" },","  \"copilot.lua\": { \"branch\": \"master\", \"commit\": \"0fa30d6846aae1af1c94a9ead93fa7dcf8affbe6\" },","  \"crates.nvim\": { \"branch\": \"main\", \"commit\": \"d5caf28aba49e81ac4099426231f3cf3c151013a\" },","  \"csv.vim\": { \"branch\": \"master\", \"commit\": \"15ff93edf5b26c466affbb356e0696b7d6a3b499\" },","  \"diffview.nvim\": { \"branch\": \"main\", \"commit\": \"7e5a85c186027cab1e825d018f07c350177077fc\" },","  \"edge\": { \"branch\": \"master\", \"commit\": \"a4fd4f458331d42677d992f428235c491b2016aa\" },","  \"fidget.nvim\": { \"branch\": \"legacy\", \"commit\": \"90c22e47be057562ee9566bad313ad42d622c1d3\" },","  \"friendly-snippets\": { \"branch\": \"main\", \"commit\": \"00e191fea2cfbbdd378243f35b5953296537a116\" },","  \"fzy-lua-native\": { \"branch\": \"master\", \"commit\": \"820f745b7c442176bcc243e8f38ef4b985febfaf\" },","  \"gitsigns.nvim\": { \"branch\": \"main\", \"commit\": \"d927caa075df63bf301d92f874efb72fd22fd3b4\" },","  \"glance.nvim\": { \"branch\": \"master\", \"commit\": \"8ed5cf3b3b1231ea696d88c9efd977027429d869\" },","  \"hop.nvim\": { \"branch\": \"master\", \"commit\": \"88516dde51b0b603ce43739220150f7b66a6841c\" },","  \"indent-blankline.nvim\": { \"branch\": \"master\", \"commit\": \"9637670896b68805430e2f72cf5d16be5b97a22a\" },","  \"lazy.nvim\": { \"branch\": \"main\", \"commit\": \"2a9354c7d2368d78cbd5575a51a2af5bd8a6ad01\" },","  \"lsp_signature.nvim\": { \"branch\": \"master\", \"commit\": \"04f0c52c6a04680f29bdecb5b2943591b8c0ff43\" },","  \"lspsaga.nvim\": { \"branch\": \"main\", \"commit\": \"e5cefc8581e3d2e2755bee4ee8b102d6caa8f6c5\" },","  \"lualine.nvim\": { \"branch\": \"master\", \"commit\": \"45e27ca739c7be6c49e5496d14fcf45a303c3a63\" },","  \"markdown-preview.nvim\": { \"branch\": \"master\", \"commit\": \"02cc3874738bc0f86e4b91f09b8a0ac88aef8e96\" },","  \"mason-lspconfig.nvim\": { \"branch\": \"main\", \"commit\": \"dfdd771b792fbb4bad8e057d72558255695aa1a7\" },","  \"mason-null-ls.nvim\": { \"branch\": \"main\", \"commit\": \"ae0c5fa57468ac65617f1bf821ba0c3a1e251f0c\" },","  \"mason-nvim-dap.nvim\": { \"branch\": \"main\", \"commit\": \"6148b51db945b55b3b725da39eaea6441e59dff8\" },","  \"mason.nvim\": { \"branch\": \"main\", \"commit\": \"0942198fb9a998b6ccee36fb8dd7495eb8ba659c\" },","  \"neodim\": { \"branch\": \"master\", \"commit\": \"1aaf133a0f952058db6b218927d582a98459af0d\" },","  \"neoscroll.nvim\": { \"branch\": \"master\", \"commit\": \"4bc0212e9f2a7bc7fe7a6bceb15b33e39f0f41fb\" },","  \"nord.nvim\": { \"branch\": \"master\", \"commit\": \"15fbfc38a83980b93e169b32a1bf64757f1e2bf4\" },","  \"null-ls.nvim\": { \"branch\": \"main\", \"commit\": \"0010ea927ab7c09ef0ce9bf28c2b573fc302f5a7\" },","  \"nvim-bufdel\": { \"branch\": \"main\", \"commit\": \"96c4f7ab053ddab0025bebe5f7c71e4795430e47\" },","  \"nvim-cmp\": { \"branch\": \"main\", \"commit\": \"5dce1b778b85c717f6614e3f4da45e9f19f54435\" },","  \"nvim-colorizer.lua\": { \"branch\": \"master\", \"commit\": \"dde3084106a70b9a79d48f426f6d6fec6fd203f7\" },","  \"nvim-dap\": { \"branch\": \"master\", \"commit\": \"31e1ece773e10448dcb616d5144290946a6264b7\" },","  \"nvim-dap-ui\": { \"branch\": \"master\", \"commit\": \"85b16ac2309d85c88577cd8ee1733ce52be8227e\" },","  \"nvim-lspconfig\": { \"branch\": \"master\", \"commit\": \"a27356f1ef9c11e1f459cc96a3fcac5c265e72d6\" },","  \"nvim-notify\": { \"branch\": \"master\", \"commit\": \"ea9c8ce7a37f2238f934e087c255758659948e0f\" },","  \"nvim-scrollview\": { \"branch\": \"main\", \"commit\": \"46d0937e5ccf8a71d3f18e4d226864f0ee3e4d1b\" },","  \"nvim-tree.lua\": { \"branch\": \"master\", \"commit\": \"28c3980b25e50e9ede39df55427151cb11be46f9\" },","  \"nvim-treehopper\": { \"branch\": \"master\", \"commit\": \"5a28bff46c05d28bdb4bcaef67e046eb915a9390\" },","  \"nvim-treesitter\": { \"branch\": \"master\", \"commit\": \"17b943e7c5cc2b2db3ac7b5720fbd42e75a00d8d\" },","  \"nvim-treesitter-context\": { \"branch\": \"master\", \"commit\": \"31692b26d76ff1f7c6e0ab51814dd55e7417e96c\" },","  \"nvim-treesitter-textobjects\": { \"branch\": \"master\", \"commit\": \"bd103502252027434ec42f628d2dbf54821d4ce6\" },","  \"nvim-ts-autotag\": { \"branch\": \"main\", \"commit\": \"6be1192965df35f94b8ea6d323354f7dc7a557e4\" },","  \"nvim-ts-context-commentstring\": { \"branch\": \"main\", \"commit\": \"9bff161dfece6ecf3459e6e46ca42e49f9ed939f\" },","  \"nvim-web-devicons\": { \"branch\": \"master\", \"commit\": \"bc11ee2498de2310de5776477dd9dce65d03b464\" },","  \"paint.nvim\": { \"branch\": \"main\", \"commit\": \"6ce64212804f425073c61ab0d9c2b034f0435260\" },","  \"persisted.nvim\": { \"branch\": \"main\", \"commit\": \"315cd1a8a501ca8e0c1d55f0c245b9cc0e1ffa01\" },","  \"plenary.nvim\": { \"branch\": \"master\", \"commit\": \"0dbe561ae023f02c2fb772b879e905055b939ce3\" },","  \"project.nvim\": { \"branch\": \"main\", \"commit\": \"8c6bad7d22eef1b71144b401c9f74ed01526a4fb\" },","  \"rainbow-delimiters.nvim\": { \"branch\": \"master\", \"commit\": \"9cbd3dc409af1f5531778ccd1ea6bce668241f39\" },","  \"rust-tools.nvim\": { \"branch\": \"master\", \"commit\": \"0cc8adab23117783a0292a0c8a2fbed1005dc645\" },","  \"smartyank.nvim\": { \"branch\": \"master\", \"commit\": \"7e3905578f646503525b2f7018b8afd17861018c\" },","  \"sniprun\": { \"branch\": \"master\", \"commit\": \"1c4bc063522946676dd178d01d6fc130d3e41da5\" },","  \"specs.nvim\": { \"branch\": \"main\", \"commit\": \"2743e412bbe21c9d73954c403d01e8de7377890d\" },","  \"sqlite.lua\": { \"branch\": \"master\", \"commit\": \"b7e28c8463254c46a8e61c52d27d6a2040492fc3\" },","  \"suda.vim\": { \"branch\": \"master\", \"commit\": \"8b0fc3711760195aba104e2d190cff9af8267052\" },","  \"symbols-outline.nvim\": { \"branch\": \"master\", \"commit\": \"512791925d57a61c545bc303356e8a8f7869763c\" },","  \"tabout.nvim\": { \"branch\": \"master\", \"commit\": \"0d275c8d25f32457e67b5c66d6ae43f26a61bce5\" },","  \"telescope-frecency.nvim\": { \"branch\": \"master\", \"commit\": \"fbda5d91d6e787f5977787fa4a81da5c8e22160a\" },","  \"telescope-fzf-native.nvim\": { \"branch\": \"main\", \"commit\": \"9bc8237565ded606e6c366a71c64c0af25cd7a50\" },","  \"telescope-live-grep-args.nvim\": { \"branch\": \"master\", \"commit\": \"851c0997d55601f2afd7290db0f90dc364e29f58\" },","  \"telescope-undo.nvim\": { \"branch\": \"main\", \"commit\": \"3dec002ea3e7952071d26fbb5d01e2038a58a554\" },","  \"telescope-zoxide\": { \"branch\": \"main\", \"commit\": \"68966349aa1b8e9ade403e18479ecf79447389a7\" },","  \"telescope.nvim\": { \"branch\": \"master\", \"commit\": \"3fae9c1e14910e6669bb8ecbb473aba6a9e13b33\" },","  \"toggleterm.nvim\": { \"branch\": \"main\", \"commit\": \"12cba0a1967b4f3f31903484dec72a6100dcf515\" },","  \"trouble.nvim\": { \"branch\": \"main\", \"commit\": \"3f85d8ed30e97ceeddbbcf80224245d347053711\" },","  \"vim-cool\": { \"branch\": \"master\", \"commit\": \"04bb7f5dade175a81b47abf4e87aeb30b05b33d8\" },","  \"vim-easy-align\": { \"branch\": \"master\", \"commit\": \"12dd6316974f71ce333e360c0260b4e1f81169c3\" },","  \"vim-fugitive\": { \"branch\": \"master\", \"commit\": \"572c8510123cbde02e8a1dafcd376c98e1e13f43\" },","  \"vim-go\": { \"branch\": \"master\", \"commit\": \"ec8f05bb24eb8324253b97f75d99114ad6565231\" },","  \"vim-illuminate\": { \"branch\": \"master\", \"commit\": \"76f28e858f1caae87bfa45fb4fd09e4b053fc45b\" },","  \"vim-matchup\": { \"branch\": \"master\", \"commit\": \"6dbe108230c7dbbf00555b7d4d9f6a891837ef07\" },","  \"which-key.nvim\": { \"branch\": \"main\", \"commit\": \"7ccf476ebe0445a741b64e36c78a682c1c6118b7\" },","  \"wilder.nvim\": { \"branch\": \"master\", \"commit\": \"679f348dc90d80ff9ba0e7c470c40a4d038dcecf\" }","}"],"stylingDirectives":[[],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":38,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":40,"end":48,"cssClass":"pl-ent"},{"start":50,"end":92,"cssClass":"pl-s"},{"start":50,"end":51,"cssClass":"pl-pds"},{"start":91,"end":92,"cssClass":"pl-pds"}],[{"start":2,"end":11,"cssClass":"pl-ent"},{"start":15,"end":23,"cssClass":"pl-ent"},{"start":25,"end":33,"cssClass":"pl-s"},{"start":25,"end":26,"cssClass":"pl-pds"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":35,"end":43,"cssClass":"pl-ent"},{"start":45,"end":87,"cssClass":"pl-s"},{"start":45,"end":46,"cssClass":"pl-pds"},{"start":86,"end":87,"cssClass":"pl-pds"}],[{"start":2,"end":23,"cssClass":"pl-ent"},{"start":27,"end":35,"cssClass":"pl-ent"},{"start":37,"end":43,"cssClass":"pl-s"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":42,"end":43,"cssClass":"pl-pds"},{"start":45,"end":53,"cssClass":"pl-ent"},{"start":55,"end":97,"cssClass":"pl-s"},{"start":55,"end":56,"cssClass":"pl-pds"},{"start":96,"end":97,"cssClass":"pl-pds"}],[{"start":2,"end":14,"cssClass":"pl-ent"},{"start":18,"end":26,"cssClass":"pl-ent"},{"start":28,"end":34,"cssClass":"pl-s"},{"start":28,"end":29,"cssClass":"pl-pds"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":36,"end":44,"cssClass":"pl-ent"},{"start":46,"end":88,"cssClass":"pl-s"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":87,"end":88,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":38,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":40,"end":48,"cssClass":"pl-ent"},{"start":50,"end":92,"cssClass":"pl-s"},{"start":50,"end":51,"cssClass":"pl-pds"},{"start":91,"end":92,"cssClass":"pl-pds"}],[{"start":2,"end":22,"cssClass":"pl-ent"},{"start":26,"end":34,"cssClass":"pl-ent"},{"start":36,"end":44,"cssClass":"pl-s"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":43,"end":44,"cssClass":"pl-pds"},{"start":46,"end":54,"cssClass":"pl-ent"},{"start":56,"end":98,"cssClass":"pl-s"},{"start":56,"end":57,"cssClass":"pl-pds"},{"start":97,"end":98,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":36,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":38,"end":46,"cssClass":"pl-ent"},{"start":48,"end":90,"cssClass":"pl-s"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":89,"end":90,"cssClass":"pl-pds"}],[{"start":2,"end":19,"cssClass":"pl-ent"},{"start":23,"end":31,"cssClass":"pl-ent"},{"start":33,"end":39,"cssClass":"pl-s"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":38,"end":39,"cssClass":"pl-pds"},{"start":41,"end":49,"cssClass":"pl-ent"},{"start":51,"end":93,"cssClass":"pl-s"},{"start":51,"end":52,"cssClass":"pl-pds"},{"start":92,"end":93,"cssClass":"pl-pds"}],[{"start":2,"end":14,"cssClass":"pl-ent"},{"start":18,"end":26,"cssClass":"pl-ent"},{"start":28,"end":58,"cssClass":"pl-s"},{"start":28,"end":29,"cssClass":"pl-pds"},{"start":57,"end":58,"cssClass":"pl-pds"},{"start":60,"end":68,"cssClass":"pl-ent"},{"start":70,"end":112,"cssClass":"pl-s"},{"start":70,"end":71,"cssClass":"pl-pds"},{"start":111,"end":112,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":38,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":40,"end":48,"cssClass":"pl-ent"},{"start":50,"end":92,"cssClass":"pl-s"},{"start":50,"end":51,"cssClass":"pl-pds"},{"start":91,"end":92,"cssClass":"pl-pds"}],[{"start":2,"end":14,"cssClass":"pl-ent"},{"start":18,"end":26,"cssClass":"pl-ent"},{"start":28,"end":34,"cssClass":"pl-s"},{"start":28,"end":29,"cssClass":"pl-pds"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":36,"end":44,"cssClass":"pl-ent"},{"start":46,"end":88,"cssClass":"pl-s"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":87,"end":88,"cssClass":"pl-pds"}],[{"start":2,"end":21,"cssClass":"pl-ent"},{"start":25,"end":33,"cssClass":"pl-ent"},{"start":35,"end":41,"cssClass":"pl-s"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":40,"end":41,"cssClass":"pl-pds"},{"start":43,"end":51,"cssClass":"pl-ent"},{"start":53,"end":95,"cssClass":"pl-s"},{"start":53,"end":54,"cssClass":"pl-pds"},{"start":94,"end":95,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":36,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":38,"end":46,"cssClass":"pl-ent"},{"start":48,"end":90,"cssClass":"pl-s"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":89,"end":90,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":36,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":38,"end":46,"cssClass":"pl-ent"},{"start":48,"end":90,"cssClass":"pl-s"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":89,"end":90,"cssClass":"pl-pds"}],[{"start":2,"end":12,"cssClass":"pl-ent"},{"start":16,"end":24,"cssClass":"pl-ent"},{"start":26,"end":32,"cssClass":"pl-s"},{"start":26,"end":27,"cssClass":"pl-pds"},{"start":31,"end":32,"cssClass":"pl-pds"},{"start":34,"end":42,"cssClass":"pl-ent"},{"start":44,"end":86,"cssClass":"pl-s"},{"start":44,"end":45,"cssClass":"pl-pds"},{"start":85,"end":86,"cssClass":"pl-pds"}],[{"start":2,"end":13,"cssClass":"pl-ent"},{"start":17,"end":25,"cssClass":"pl-ent"},{"start":27,"end":35,"cssClass":"pl-s"},{"start":27,"end":28,"cssClass":"pl-pds"},{"start":34,"end":35,"cssClass":"pl-pds"},{"start":37,"end":45,"cssClass":"pl-ent"},{"start":47,"end":89,"cssClass":"pl-s"},{"start":47,"end":48,"cssClass":"pl-pds"},{"start":88,"end":89,"cssClass":"pl-pds"}],[{"start":2,"end":12,"cssClass":"pl-ent"},{"start":16,"end":24,"cssClass":"pl-ent"},{"start":26,"end":32,"cssClass":"pl-s"},{"start":26,"end":27,"cssClass":"pl-pds"},{"start":31,"end":32,"cssClass":"pl-pds"},{"start":34,"end":42,"cssClass":"pl-ent"},{"start":44,"end":86,"cssClass":"pl-s"},{"start":44,"end":45,"cssClass":"pl-pds"},{"start":85,"end":86,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":40,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":42,"end":50,"cssClass":"pl-ent"},{"start":52,"end":94,"cssClass":"pl-s"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":93,"end":94,"cssClass":"pl-pds"}],[{"start":2,"end":24,"cssClass":"pl-ent"},{"start":28,"end":36,"cssClass":"pl-ent"},{"start":38,"end":46,"cssClass":"pl-s"},{"start":38,"end":39,"cssClass":"pl-pds"},{"start":45,"end":46,"cssClass":"pl-pds"},{"start":48,"end":56,"cssClass":"pl-ent"},{"start":58,"end":100,"cssClass":"pl-s"},{"start":58,"end":59,"cssClass":"pl-pds"},{"start":99,"end":100,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":35,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":34,"end":35,"cssClass":"pl-pds"},{"start":37,"end":45,"cssClass":"pl-ent"},{"start":47,"end":89,"cssClass":"pl-s"},{"start":47,"end":48,"cssClass":"pl-pds"},{"start":88,"end":89,"cssClass":"pl-pds"}],[{"start":2,"end":11,"cssClass":"pl-ent"},{"start":15,"end":23,"cssClass":"pl-ent"},{"start":25,"end":33,"cssClass":"pl-s"},{"start":25,"end":26,"cssClass":"pl-pds"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":35,"end":43,"cssClass":"pl-ent"},{"start":45,"end":87,"cssClass":"pl-s"},{"start":45,"end":46,"cssClass":"pl-pds"},{"start":86,"end":87,"cssClass":"pl-pds"}],[{"start":2,"end":17,"cssClass":"pl-ent"},{"start":21,"end":29,"cssClass":"pl-ent"},{"start":31,"end":37,"cssClass":"pl-s"},{"start":31,"end":32,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":8,"cssClass":"pl-ent"},{"start":12,"end":20,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-s"},{"start":22,"end":23,"cssClass":"pl-pds"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":32,"end":40,"cssClass":"pl-ent"},{"start":42,"end":84,"cssClass":"pl-s"},{"start":42,"end":43,"cssClass":"pl-pds"},{"start":83,"end":84,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":21,"cssClass":"pl-ent"},{"start":25,"end":33,"cssClass":"pl-ent"},{"start":35,"end":41,"cssClass":"pl-s"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":40,"end":41,"cssClass":"pl-pds"},{"start":43,"end":51,"cssClass":"pl-ent"},{"start":53,"end":95,"cssClass":"pl-s"},{"start":53,"end":54,"cssClass":"pl-pds"},{"start":94,"end":95,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":40,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":42,"end":50,"cssClass":"pl-ent"},{"start":52,"end":94,"cssClass":"pl-s"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":93,"end":94,"cssClass":"pl-pds"}],[{"start":2,"end":17,"cssClass":"pl-ent"},{"start":21,"end":29,"cssClass":"pl-ent"},{"start":31,"end":37,"cssClass":"pl-s"},{"start":31,"end":32,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":12,"cssClass":"pl-ent"},{"start":16,"end":24,"cssClass":"pl-ent"},{"start":26,"end":34,"cssClass":"pl-s"},{"start":26,"end":27,"cssClass":"pl-pds"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":36,"end":44,"cssClass":"pl-ent"},{"start":46,"end":88,"cssClass":"pl-s"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":87,"end":88,"cssClass":"pl-pds"}],[{"start":2,"end":25,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-ent"},{"start":39,"end":47,"cssClass":"pl-s"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":49,"end":57,"cssClass":"pl-ent"},{"start":59,"end":101,"cssClass":"pl-s"},{"start":59,"end":60,"cssClass":"pl-pds"},{"start":100,"end":101,"cssClass":"pl-pds"}],[{"start":2,"end":13,"cssClass":"pl-ent"},{"start":17,"end":25,"cssClass":"pl-ent"},{"start":27,"end":33,"cssClass":"pl-s"},{"start":27,"end":28,"cssClass":"pl-pds"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":35,"end":43,"cssClass":"pl-ent"},{"start":45,"end":87,"cssClass":"pl-s"},{"start":45,"end":46,"cssClass":"pl-pds"},{"start":86,"end":87,"cssClass":"pl-pds"}],[{"start":2,"end":22,"cssClass":"pl-ent"},{"start":26,"end":34,"cssClass":"pl-ent"},{"start":36,"end":44,"cssClass":"pl-s"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":43,"end":44,"cssClass":"pl-pds"},{"start":46,"end":54,"cssClass":"pl-ent"},{"start":56,"end":98,"cssClass":"pl-s"},{"start":56,"end":57,"cssClass":"pl-pds"},{"start":97,"end":98,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":36,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":38,"end":46,"cssClass":"pl-ent"},{"start":48,"end":90,"cssClass":"pl-s"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":89,"end":90,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":38,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":40,"end":48,"cssClass":"pl-ent"},{"start":50,"end":92,"cssClass":"pl-s"},{"start":50,"end":51,"cssClass":"pl-pds"},{"start":91,"end":92,"cssClass":"pl-pds"}],[{"start":2,"end":25,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-ent"},{"start":39,"end":47,"cssClass":"pl-s"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":49,"end":57,"cssClass":"pl-ent"},{"start":59,"end":101,"cssClass":"pl-s"},{"start":59,"end":60,"cssClass":"pl-pds"},{"start":100,"end":101,"cssClass":"pl-pds"}],[{"start":2,"end":24,"cssClass":"pl-ent"},{"start":28,"end":36,"cssClass":"pl-ent"},{"start":38,"end":44,"cssClass":"pl-s"},{"start":38,"end":39,"cssClass":"pl-pds"},{"start":43,"end":44,"cssClass":"pl-pds"},{"start":46,"end":54,"cssClass":"pl-ent"},{"start":56,"end":98,"cssClass":"pl-s"},{"start":56,"end":57,"cssClass":"pl-pds"},{"start":97,"end":98,"cssClass":"pl-pds"}],[{"start":2,"end":22,"cssClass":"pl-ent"},{"start":26,"end":34,"cssClass":"pl-ent"},{"start":36,"end":42,"cssClass":"pl-s"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":41,"end":42,"cssClass":"pl-pds"},{"start":44,"end":52,"cssClass":"pl-ent"},{"start":54,"end":96,"cssClass":"pl-s"},{"start":54,"end":55,"cssClass":"pl-pds"},{"start":95,"end":96,"cssClass":"pl-pds"}],[{"start":2,"end":23,"cssClass":"pl-ent"},{"start":27,"end":35,"cssClass":"pl-ent"},{"start":37,"end":43,"cssClass":"pl-s"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":42,"end":43,"cssClass":"pl-pds"},{"start":45,"end":53,"cssClass":"pl-ent"},{"start":55,"end":97,"cssClass":"pl-s"},{"start":55,"end":56,"cssClass":"pl-pds"},{"start":96,"end":97,"cssClass":"pl-pds"}],[{"start":2,"end":14,"cssClass":"pl-ent"},{"start":18,"end":26,"cssClass":"pl-ent"},{"start":28,"end":34,"cssClass":"pl-s"},{"start":28,"end":29,"cssClass":"pl-pds"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":36,"end":44,"cssClass":"pl-ent"},{"start":46,"end":88,"cssClass":"pl-s"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":87,"end":88,"cssClass":"pl-pds"}],[{"start":2,"end":10,"cssClass":"pl-ent"},{"start":14,"end":22,"cssClass":"pl-ent"},{"start":24,"end":32,"cssClass":"pl-s"},{"start":24,"end":25,"cssClass":"pl-pds"},{"start":31,"end":32,"cssClass":"pl-pds"},{"start":34,"end":42,"cssClass":"pl-ent"},{"start":44,"end":86,"cssClass":"pl-s"},{"start":44,"end":45,"cssClass":"pl-pds"},{"start":85,"end":86,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":40,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":42,"end":50,"cssClass":"pl-ent"},{"start":52,"end":94,"cssClass":"pl-s"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":93,"end":94,"cssClass":"pl-pds"}],[{"start":2,"end":13,"cssClass":"pl-ent"},{"start":17,"end":25,"cssClass":"pl-ent"},{"start":27,"end":35,"cssClass":"pl-s"},{"start":27,"end":28,"cssClass":"pl-pds"},{"start":34,"end":35,"cssClass":"pl-pds"},{"start":37,"end":45,"cssClass":"pl-ent"},{"start":47,"end":89,"cssClass":"pl-s"},{"start":47,"end":48,"cssClass":"pl-pds"},{"start":88,"end":89,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":36,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":38,"end":46,"cssClass":"pl-ent"},{"start":48,"end":90,"cssClass":"pl-s"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":89,"end":90,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":35,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":34,"end":35,"cssClass":"pl-pds"},{"start":37,"end":45,"cssClass":"pl-ent"},{"start":47,"end":89,"cssClass":"pl-s"},{"start":47,"end":48,"cssClass":"pl-pds"},{"start":88,"end":89,"cssClass":"pl-pds"}],[{"start":2,"end":12,"cssClass":"pl-ent"},{"start":16,"end":24,"cssClass":"pl-ent"},{"start":26,"end":32,"cssClass":"pl-s"},{"start":26,"end":27,"cssClass":"pl-pds"},{"start":31,"end":32,"cssClass":"pl-pds"},{"start":34,"end":42,"cssClass":"pl-ent"},{"start":44,"end":86,"cssClass":"pl-s"},{"start":44,"end":45,"cssClass":"pl-pds"},{"start":85,"end":86,"cssClass":"pl-pds"}],[{"start":2,"end":22,"cssClass":"pl-ent"},{"start":26,"end":34,"cssClass":"pl-ent"},{"start":36,"end":44,"cssClass":"pl-s"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":43,"end":44,"cssClass":"pl-pds"},{"start":46,"end":54,"cssClass":"pl-ent"},{"start":56,"end":98,"cssClass":"pl-s"},{"start":56,"end":57,"cssClass":"pl-pds"},{"start":97,"end":98,"cssClass":"pl-pds"}],[{"start":2,"end":12,"cssClass":"pl-ent"},{"start":16,"end":24,"cssClass":"pl-ent"},{"start":26,"end":34,"cssClass":"pl-s"},{"start":26,"end":27,"cssClass":"pl-pds"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":36,"end":44,"cssClass":"pl-ent"},{"start":46,"end":88,"cssClass":"pl-s"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":87,"end":88,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":40,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":42,"end":50,"cssClass":"pl-ent"},{"start":52,"end":94,"cssClass":"pl-s"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":93,"end":94,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":19,"cssClass":"pl-ent"},{"start":23,"end":31,"cssClass":"pl-ent"},{"start":33,"end":39,"cssClass":"pl-s"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":38,"end":39,"cssClass":"pl-pds"},{"start":41,"end":49,"cssClass":"pl-ent"},{"start":51,"end":93,"cssClass":"pl-s"},{"start":51,"end":52,"cssClass":"pl-pds"},{"start":92,"end":93,"cssClass":"pl-pds"}],[{"start":2,"end":17,"cssClass":"pl-ent"},{"start":21,"end":29,"cssClass":"pl-ent"},{"start":31,"end":39,"cssClass":"pl-s"},{"start":31,"end":32,"cssClass":"pl-pds"},{"start":38,"end":39,"cssClass":"pl-pds"},{"start":41,"end":49,"cssClass":"pl-ent"},{"start":51,"end":93,"cssClass":"pl-s"},{"start":51,"end":52,"cssClass":"pl-pds"},{"start":92,"end":93,"cssClass":"pl-pds"}],[{"start":2,"end":19,"cssClass":"pl-ent"},{"start":23,"end":31,"cssClass":"pl-ent"},{"start":33,"end":41,"cssClass":"pl-s"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":40,"end":41,"cssClass":"pl-pds"},{"start":43,"end":51,"cssClass":"pl-ent"},{"start":53,"end":95,"cssClass":"pl-s"},{"start":53,"end":54,"cssClass":"pl-pds"},{"start":94,"end":95,"cssClass":"pl-pds"}],[{"start":2,"end":19,"cssClass":"pl-ent"},{"start":23,"end":31,"cssClass":"pl-ent"},{"start":33,"end":41,"cssClass":"pl-s"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":40,"end":41,"cssClass":"pl-pds"},{"start":43,"end":51,"cssClass":"pl-ent"},{"start":53,"end":95,"cssClass":"pl-s"},{"start":53,"end":54,"cssClass":"pl-pds"},{"start":94,"end":95,"cssClass":"pl-pds"}],[{"start":2,"end":27,"cssClass":"pl-ent"},{"start":31,"end":39,"cssClass":"pl-ent"},{"start":41,"end":49,"cssClass":"pl-s"},{"start":41,"end":42,"cssClass":"pl-pds"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":51,"end":59,"cssClass":"pl-ent"},{"start":61,"end":103,"cssClass":"pl-s"},{"start":61,"end":62,"cssClass":"pl-pds"},{"start":102,"end":103,"cssClass":"pl-pds"}],[{"start":2,"end":31,"cssClass":"pl-ent"},{"start":35,"end":43,"cssClass":"pl-ent"},{"start":45,"end":53,"cssClass":"pl-s"},{"start":45,"end":46,"cssClass":"pl-pds"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":55,"end":63,"cssClass":"pl-ent"},{"start":65,"end":107,"cssClass":"pl-s"},{"start":65,"end":66,"cssClass":"pl-pds"},{"start":106,"end":107,"cssClass":"pl-pds"}],[{"start":2,"end":19,"cssClass":"pl-ent"},{"start":23,"end":31,"cssClass":"pl-ent"},{"start":33,"end":39,"cssClass":"pl-s"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":38,"end":39,"cssClass":"pl-pds"},{"start":41,"end":49,"cssClass":"pl-ent"},{"start":51,"end":93,"cssClass":"pl-s"},{"start":51,"end":52,"cssClass":"pl-pds"},{"start":92,"end":93,"cssClass":"pl-pds"}],[{"start":2,"end":33,"cssClass":"pl-ent"},{"start":37,"end":45,"cssClass":"pl-ent"},{"start":47,"end":53,"cssClass":"pl-s"},{"start":47,"end":48,"cssClass":"pl-pds"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":55,"end":63,"cssClass":"pl-ent"},{"start":65,"end":107,"cssClass":"pl-s"},{"start":65,"end":66,"cssClass":"pl-pds"},{"start":106,"end":107,"cssClass":"pl-pds"}],[{"start":2,"end":21,"cssClass":"pl-ent"},{"start":25,"end":33,"cssClass":"pl-ent"},{"start":35,"end":43,"cssClass":"pl-s"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":42,"end":43,"cssClass":"pl-pds"},{"start":45,"end":53,"cssClass":"pl-ent"},{"start":55,"end":97,"cssClass":"pl-s"},{"start":55,"end":56,"cssClass":"pl-pds"},{"start":96,"end":97,"cssClass":"pl-pds"}],[{"start":2,"end":14,"cssClass":"pl-ent"},{"start":18,"end":26,"cssClass":"pl-ent"},{"start":28,"end":34,"cssClass":"pl-s"},{"start":28,"end":29,"cssClass":"pl-pds"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":36,"end":44,"cssClass":"pl-ent"},{"start":46,"end":88,"cssClass":"pl-s"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":87,"end":88,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":38,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":40,"end":48,"cssClass":"pl-ent"},{"start":50,"end":92,"cssClass":"pl-s"},{"start":50,"end":51,"cssClass":"pl-pds"},{"start":91,"end":92,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":38,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":40,"end":48,"cssClass":"pl-ent"},{"start":50,"end":92,"cssClass":"pl-s"},{"start":50,"end":51,"cssClass":"pl-pds"},{"start":91,"end":92,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":36,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":38,"end":46,"cssClass":"pl-ent"},{"start":48,"end":90,"cssClass":"pl-s"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":89,"end":90,"cssClass":"pl-pds"}],[{"start":2,"end":27,"cssClass":"pl-ent"},{"start":31,"end":39,"cssClass":"pl-ent"},{"start":41,"end":49,"cssClass":"pl-s"},{"start":41,"end":42,"cssClass":"pl-pds"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":51,"end":59,"cssClass":"pl-ent"},{"start":61,"end":103,"cssClass":"pl-s"},{"start":61,"end":62,"cssClass":"pl-pds"},{"start":102,"end":103,"cssClass":"pl-pds"}],[{"start":2,"end":19,"cssClass":"pl-ent"},{"start":23,"end":31,"cssClass":"pl-ent"},{"start":33,"end":41,"cssClass":"pl-s"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":40,"end":41,"cssClass":"pl-pds"},{"start":43,"end":51,"cssClass":"pl-ent"},{"start":53,"end":95,"cssClass":"pl-s"},{"start":53,"end":54,"cssClass":"pl-pds"},{"start":94,"end":95,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":40,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":42,"end":50,"cssClass":"pl-ent"},{"start":52,"end":94,"cssClass":"pl-s"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":93,"end":94,"cssClass":"pl-pds"}],[{"start":2,"end":11,"cssClass":"pl-ent"},{"start":15,"end":23,"cssClass":"pl-ent"},{"start":25,"end":33,"cssClass":"pl-s"},{"start":25,"end":26,"cssClass":"pl-pds"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":35,"end":43,"cssClass":"pl-ent"},{"start":45,"end":87,"cssClass":"pl-s"},{"start":45,"end":46,"cssClass":"pl-pds"},{"start":86,"end":87,"cssClass":"pl-pds"}],[{"start":2,"end":14,"cssClass":"pl-ent"},{"start":18,"end":26,"cssClass":"pl-ent"},{"start":28,"end":34,"cssClass":"pl-s"},{"start":28,"end":29,"cssClass":"pl-pds"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":36,"end":44,"cssClass":"pl-ent"},{"start":46,"end":88,"cssClass":"pl-s"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":87,"end":88,"cssClass":"pl-pds"}],[{"start":2,"end":14,"cssClass":"pl-ent"},{"start":18,"end":26,"cssClass":"pl-ent"},{"start":28,"end":36,"cssClass":"pl-s"},{"start":28,"end":29,"cssClass":"pl-pds"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":38,"end":46,"cssClass":"pl-ent"},{"start":48,"end":90,"cssClass":"pl-s"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":89,"end":90,"cssClass":"pl-pds"}],[{"start":2,"end":12,"cssClass":"pl-ent"},{"start":16,"end":24,"cssClass":"pl-ent"},{"start":26,"end":34,"cssClass":"pl-s"},{"start":26,"end":27,"cssClass":"pl-pds"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":36,"end":44,"cssClass":"pl-ent"},{"start":46,"end":88,"cssClass":"pl-s"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":87,"end":88,"cssClass":"pl-pds"}],[{"start":2,"end":24,"cssClass":"pl-ent"},{"start":28,"end":36,"cssClass":"pl-ent"},{"start":38,"end":46,"cssClass":"pl-s"},{"start":38,"end":39,"cssClass":"pl-pds"},{"start":45,"end":46,"cssClass":"pl-pds"},{"start":48,"end":56,"cssClass":"pl-ent"},{"start":58,"end":100,"cssClass":"pl-s"},{"start":58,"end":59,"cssClass":"pl-pds"},{"start":99,"end":100,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":27,"cssClass":"pl-ent"},{"start":31,"end":39,"cssClass":"pl-ent"},{"start":41,"end":49,"cssClass":"pl-s"},{"start":41,"end":42,"cssClass":"pl-pds"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":51,"end":59,"cssClass":"pl-ent"},{"start":61,"end":103,"cssClass":"pl-s"},{"start":61,"end":62,"cssClass":"pl-pds"},{"start":102,"end":103,"cssClass":"pl-pds"}],[{"start":2,"end":29,"cssClass":"pl-ent"},{"start":33,"end":41,"cssClass":"pl-ent"},{"start":43,"end":49,"cssClass":"pl-s"},{"start":43,"end":44,"cssClass":"pl-pds"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":51,"end":59,"cssClass":"pl-ent"},{"start":61,"end":103,"cssClass":"pl-s"},{"start":61,"end":62,"cssClass":"pl-pds"},{"start":102,"end":103,"cssClass":"pl-pds"}],[{"start":2,"end":33,"cssClass":"pl-ent"},{"start":37,"end":45,"cssClass":"pl-ent"},{"start":47,"end":55,"cssClass":"pl-s"},{"start":47,"end":48,"cssClass":"pl-pds"},{"start":54,"end":55,"cssClass":"pl-pds"},{"start":57,"end":65,"cssClass":"pl-ent"},{"start":67,"end":109,"cssClass":"pl-s"},{"start":67,"end":68,"cssClass":"pl-pds"},{"start":108,"end":109,"cssClass":"pl-pds"}],[{"start":2,"end":23,"cssClass":"pl-ent"},{"start":27,"end":35,"cssClass":"pl-ent"},{"start":37,"end":43,"cssClass":"pl-s"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":42,"end":43,"cssClass":"pl-pds"},{"start":45,"end":53,"cssClass":"pl-ent"},{"start":55,"end":97,"cssClass":"pl-s"},{"start":55,"end":56,"cssClass":"pl-pds"},{"start":96,"end":97,"cssClass":"pl-pds"}],[{"start":2,"end":20,"cssClass":"pl-ent"},{"start":24,"end":32,"cssClass":"pl-ent"},{"start":34,"end":40,"cssClass":"pl-s"},{"start":34,"end":35,"cssClass":"pl-pds"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":42,"end":50,"cssClass":"pl-ent"},{"start":52,"end":94,"cssClass":"pl-s"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":93,"end":94,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":40,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":42,"end":50,"cssClass":"pl-ent"},{"start":52,"end":94,"cssClass":"pl-s"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":93,"end":94,"cssClass":"pl-pds"}],[{"start":2,"end":19,"cssClass":"pl-ent"},{"start":23,"end":31,"cssClass":"pl-ent"},{"start":33,"end":39,"cssClass":"pl-s"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":38,"end":39,"cssClass":"pl-pds"},{"start":41,"end":49,"cssClass":"pl-ent"},{"start":51,"end":93,"cssClass":"pl-s"},{"start":51,"end":52,"cssClass":"pl-pds"},{"start":92,"end":93,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":36,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":35,"end":36,"cssClass":"pl-pds"},{"start":38,"end":46,"cssClass":"pl-ent"},{"start":48,"end":90,"cssClass":"pl-s"},{"start":48,"end":49,"cssClass":"pl-pds"},{"start":89,"end":90,"cssClass":"pl-pds"}],[{"start":2,"end":12,"cssClass":"pl-ent"},{"start":16,"end":24,"cssClass":"pl-ent"},{"start":26,"end":34,"cssClass":"pl-s"},{"start":26,"end":27,"cssClass":"pl-pds"},{"start":33,"end":34,"cssClass":"pl-pds"},{"start":36,"end":44,"cssClass":"pl-ent"},{"start":46,"end":88,"cssClass":"pl-s"},{"start":46,"end":47,"cssClass":"pl-pds"},{"start":87,"end":88,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":40,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":42,"end":50,"cssClass":"pl-ent"},{"start":52,"end":94,"cssClass":"pl-s"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":93,"end":94,"cssClass":"pl-pds"}],[{"start":2,"end":16,"cssClass":"pl-ent"},{"start":20,"end":28,"cssClass":"pl-ent"},{"start":30,"end":38,"cssClass":"pl-s"},{"start":30,"end":31,"cssClass":"pl-pds"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":40,"end":48,"cssClass":"pl-ent"},{"start":50,"end":92,"cssClass":"pl-s"},{"start":50,"end":51,"cssClass":"pl-pds"},{"start":91,"end":92,"cssClass":"pl-pds"}],[{"start":2,"end":10,"cssClass":"pl-ent"},{"start":14,"end":22,"cssClass":"pl-ent"},{"start":24,"end":32,"cssClass":"pl-s"},{"start":24,"end":25,"cssClass":"pl-pds"},{"start":31,"end":32,"cssClass":"pl-pds"},{"start":34,"end":42,"cssClass":"pl-ent"},{"start":44,"end":86,"cssClass":"pl-s"},{"start":44,"end":45,"cssClass":"pl-pds"},{"start":85,"end":86,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":40,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":39,"end":40,"cssClass":"pl-pds"},{"start":42,"end":50,"cssClass":"pl-ent"},{"start":52,"end":94,"cssClass":"pl-s"},{"start":52,"end":53,"cssClass":"pl-pds"},{"start":93,"end":94,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[{"start":2,"end":18,"cssClass":"pl-ent"},{"start":22,"end":30,"cssClass":"pl-ent"},{"start":32,"end":38,"cssClass":"pl-s"},{"start":32,"end":33,"cssClass":"pl-pds"},{"start":37,"end":38,"cssClass":"pl-pds"},{"start":40,"end":48,"cssClass":"pl-ent"},{"start":50,"end":92,"cssClass":"pl-s"},{"start":50,"end":51,"cssClass":"pl-pds"},{"start":91,"end":92,"cssClass":"pl-pds"}],[{"start":2,"end":15,"cssClass":"pl-ent"},{"start":19,"end":27,"cssClass":"pl-ent"},{"start":29,"end":37,"cssClass":"pl-s"},{"start":29,"end":30,"cssClass":"pl-pds"},{"start":36,"end":37,"cssClass":"pl-pds"},{"start":39,"end":47,"cssClass":"pl-ent"},{"start":49,"end":91,"cssClass":"pl-s"},{"start":49,"end":50,"cssClass":"pl-pds"},{"start":90,"end":91,"cssClass":"pl-pds"}],[]],"csv":null,"csvError":null,"dependabotInfo":{"showConfigurationBanner":false,"configFilePath":null,"networkDependabotPath":"/ayamir/nvimdots/network/updates","dismissConfigurationNoticePath":"/settings/dismiss-notice/dependabot_configuration_notice","configurationNoticeDismissed":null,"repoAlertsPath":"/ayamir/nvimdots/security/dependabot","repoSecurityAndAnalysisPath":"/ayamir/nvimdots/settings/security_analysis","repoOwnerIsOrg":false,"currentUserCanAdminRepo":false},"displayName":"lazy-lock.json","displayUrl":"https://github.com/ayamir/nvimdots/blob/main/lazy-lock.json?raw=true","headerInfo":{"blobSize":"8.63 KB","deleteInfo":{"deleteTooltip":"You must be signed in to make or propose changes"},"editInfo":{"editTooltip":"You must be signed in to make or propose changes"},"ghDesktopPath":"https://desktop.github.com","gitLfsPath":null,"onBranch":true,"shortPath":"65f8597","siteNavLoginPath":"/login?return_to=https%3A%2F%2Fgithub.com%2Fayamir%2Fnvimdots%2Fblob%2Fmain%2Flazy-lock.json","isCSV":false,"isRichtext":false,"toc":null,"lineInfo":{"truncatedLoc":"93","truncatedSloc":"93"},"mode":"file"},"image":false,"isCodeownersFile":null,"isPlain":false,"isValidLegacyIssueTemplate":false,"issueTemplateHelpUrl":"https://docs.github.com/articles/about-issue-and-pull-request-templates","issueTemplate":null,"discussionTemplate":null,"language":"JSON","languageID":174,"large":false,"loggedIn":false,"newDiscussionPath":"/ayamir/nvimdots/discussions/new","newIssuePath":"/ayamir/nvimdots/issues/new","planSupportInfo":{"repoIsFork":null,"repoOwnedByCurrentUser":null,"requestFullPath":"/ayamir/nvimdots/blob/main/lazy-lock.json","showFreeOrgGatedFeatureMessage":null,"showPlanSupportBanner":null,"upgradeDataAttributes":null,"upgradePath":null},"publishBannersInfo":{"dismissActionNoticePath":"/settings/dismiss-notice/publish_action_from_dockerfile","dismissStackNoticePath":"/settings/dismiss-notice/publish_stack_from_file","releasePath":"/ayamir/nvimdots/releases/new?marketplace=true","showPublishActionBanner":false,"showPublishStackBanner":false},"renderImageOrRaw":false,"richText":null,"renderedFileInfo":null,"shortPath":null,"tabSize":8,"topBannersInfo":{"overridingGlobalFundingFile":false,"globalPreferredFundingPath":null,"repoOwner":"ayamir","repoName":"nvimdots","showInvalidCitationWarning":false,"citationHelpUrl":"https://docs.github.com/en/github/creating-cloning-and-archiving-repositories/creating-a-repository-on-github/about-citation-files","showDependabotConfigurationBanner":false,"actionsOnboardingTip":null},"truncated":false,"viewable":true,"workflowRedirectUrl":null,"symbols":{"timedOut":false,"notAnalyzed":true,"symbols":[]}},"copilotInfo":null,"csrf_tokens":{"/ayamir/nvimdots/branches":{"post":"cbLWqae2-4dGae7bhiVG2wipgudS7hq_mcl3en5gokv2GXFP8--dUq-S_iJ_pkO8I7nH8qiwFoEzerHVE3ugMA"},"/repos/preferences":{"post":"7Mr2wzREgsz_ajN0NuB1Fgv0MEnC6BjhlaMNgz7nGvuga-fBDAa4RpMRTczV3V0itHphMkXqB2rnxph9cBAcfQ"}}},"title":"nvimdots/lazy-lock.json at main · ayamir/nvimdots"}
{
  "Comment.nvim": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "accelerated-jk.nvim": { "branch": "main" },
  "alpha-nvim": { "branch": "main" },
  "autoclose.nvim": { "branch": "main" },
  "better-escape.nvim": { "branch": "master" },
  "bigfile.nvim": { "branch": "main" },
  "bufferline.nvim": { "branch": "main" },
  "catppuccin": { "branch": "refactor/syntax-highlighting" },
  "clever-f.vim": { "branch": "master" },
  "cmp-buffer": { "branch": "main" },
  "cmp-latex-symbols": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-nvim-lua": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-spell": { "branch": "master" },
  "cmp-tmux": { "branch": "main" },
  "cmp-treesitter": { "branch": "master" },
  "cmp-under-comparator": { "branch": "master" },
  "cmp_luasnip": { "branch": "master" },
  "copilot-cmp": { "branch": "master" },
  "copilot.lua": { "branch": "master" },
  "crates.nvim": { "branch": "main" },
  "csv.vim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "edge": { "branch": "master" },
  "fidget.nvim": { "branch": "legacy" },
  "friendly-snippets": { "branch": "main" },
  "fzy-lua-native": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "glance.nvim": { "branch": "master" },
  "hop.nvim": { "branch": "master" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lsp_signature.nvim": { "branch": "master" },
  "lspsaga.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "markdown-preview.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason-null-ls.nvim": { "branch": "main" },
  "mason-nvim-dap.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "neodim": { "branch": "master" },
  "neoscroll.nvim": { "branch": "master" },
  "nord.nvim": { "branch": "master" },
  "null-ls.nvim": { "branch": "main" },
  "nvim-bufdel": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-scrollview": { "branch": "main" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treehopper": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-ts-context-commentstring": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "paint.nvim": { "branch": "main" },
  "persisted.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "project.nvim": { "branch": "main" },
  "rainbow-delimiters.nvim": { "branch": "master" },
  "rust-tools.nvim": { "branch": "master" },
  "smartyank.nvim": { "branch": "master" },
  "sniprun": { "branch": "master" },
  "specs.nvim": { "branch": "main" },
  "sqlite.lua": { "branch": "master" },
  "suda.vim": { "branch": "master" },
  "symbols-outline.nvim": { "branch": "master" },
  "tabout.nvim": { "branch": "master" },
  "telescope-frecency.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-live-grep-args.nvim": { "branch": "master" },
  "telescope-undo.nvim": { "branch": "main" },
  "telescope-zoxide": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "toggleterm.nvim": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "vim-cool": { "branch": "master" },
  "vim-easy-align": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-go": { "branch": "master" },
  "vim-illuminate": { "branch": "master" },
  "vim-matchup": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
  "wilder.nvim": { "branch": "master" }
}
